<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Acrobat Reader and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.die.pkg.AcrobatReader</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Adobe Acrobat Reader</string>
		<key>NAME</key>
		<string>Acrobat Reader</string>
		<key>CATEGORY</key>
		<string>Programme</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.die.download.AcrobatReader</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
				<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_category</key>
			<string>%CATEGORY%</string>
		</dict>
		<key>Processor</key>
		<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
	</dict>
	</array>
</dict>
</plist>
